Repository: TawheebAlsuidy/rwshan-gold
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Home
ar: الرئيسية

source: About Us
ar: من نحن

source: Products
ar: المنتجات

source: Design Your Uniform
ar: صمم زيّك

source: Get a Quote
ar: عرض سعر

source: Blog
ar: المدونة

source: Contact
ar: اتصل بنا

source: Professional Uniforms that Elevate Your Brand Image
ar: الزي المهني الذي يرفع من صورة علامتك التجارية

source: Our Sectors
ar: قطاعاتنا

source: Explore
ar: استكشاف

source: School Uniforms
ar: أزياء مدرسية

source: Medical Uniforms
ar: أزياء طبية

source: Restaurants
ar: أزياء مطاعم

source: Factories
ar: أزياء مصانع

source: We are committed to excellence in every stitch
ar: نحن ملتزمون بالتميز في عملنا

source: in a short time, in different sizes and multiple shapes for all sectors.
ar: في وقت وجيز وبمقاﺳﺎت ﻣﺨﺘﻠﻔﺔ وأﺷﻜﺎل ﻣﺘﻌﺪده ﻟﺠﻤﻴﻊ اﻟﻘﻄﺎﻋﺎت

source: Why Choose Rwshan Gold?
ar: لماذا تختار الروشن الذهبي؟

source: Quality
ar: الجودة

source: Request a Quote
ar: اطلب عرض سعر

source: Premium materials and craftsmanship
ar: مواد عالية الجودة وحرفية ممتازة

source: Innovation
ar: الابتكار

source: Cutting-edge design and technology
ar: تصميم وتقنية متطورة

source: Speed
ar: السرعة

source: Fast delivery and turnaround times
ar: تسليم سريع وأوقات إنجاز سريعة

source: What Our Clients Say
ar: ماذا يقول عملاؤنا

source: View All Testimonials
ar: عرض جميع الشهادات

source: Ready to Elevate Your Brand?
ar: هل أنت مستعد لرفع مستوى علامتك التجارية؟

source: Get a free quote for your custom uniforms today
ar: احصل على عرض سعر مجاني لزيّك المخصص اليوم

source: About Rwshan Gold Company
ar: عن شركة الروشن الذهبي

source: Price Calculator
ar: حاسبة السعر

source: Our Products
ar: منتجاتنا

source: Quick Links
ar: الروابط السريعة

source: Select Product
ar: المنتج

source: Select Fabric
ar: القماش

source: Select Color
ar: اللون

source: Contact Us
ar: اتصل بنا

source: Premium quality uniforms tailored to your business needs
ar: أزياء رسمية عالية الجودة مصممة خصيصًا لتلبية احتياجات عملك

source: We manufacture professional uniforms in large quantities
ar: ﻧﺼﻨﻊ اﻟﻤﻼﺑﺲ اﻟﻤﻬﻨﻴﺔ اﻟﻤﻮﺣﺪة ﺑﻜﻤﻴﺎت ﻋﺎﻟية

source: SAR
ar: ر.س

source: Rwshan Gold Company is a leading manufacturer of professional uniforms in Saudi Arabia, committed to quality, innovation, and customer satisfaction.
ar: شركة روشان الذهبية هي الشركة الرائدة في تصنيع الزي الرسمي المهني في المملكة العربية السعودية، ملتزمة بالجودة والابتكار ورضا العملاء.

source: Leading Manufacturer of Professional Uniforms in Saudi Arabia
ar: رائع مصنعي الزي المهني في المملكة العربية السعودية

source: Our Story
ar: قصتنا

source: Request Date
ar: تاريخ الطلب

source: Review the details of your custom gold product request
ar: قم بمراجعة تفاصيل طلبك

source: Pricing & Status
ar: التسعير & الحالة

source: Product Specifications
ar: مواصفات المنتج

source: Track and manage all your gold product quote requests
ar: تتبع جميع عروض الأسعار الخاصة بك

source: Status
ar: حالة الطلب

source: Founded in Riyadh, Saudi Arabia, Rwshan Gold Company has established itself as a premier manufacturer and supplier of professional uniforms across multiple sectors. With years of experience in the industry, we have built a reputation for excellence, innovation, and reliability.
ar: تأسست شركة الروشن الذهبي في مكة، المملكة العربية السعودية، وأصبحت من المصنعين والموردين الرائدين للزي المهني عبر قطاعات متعددة. بسنوات من الخبرة في الصناعة، بنينا سمعة للتميز والابتكار والموثوقية.

source: Our commitment to quality craftsmanship and attention to detail has made us the preferred choice for leading businesses and institutions throughout the Kingdom.
ar: التزامنا بالجودة الحرفية والاهتمام بالتفاصيل جعلنا الخيار المفضل للشركات والمؤسسات الرائدة في جميع أنحاء المملكة.

source: Our Vision
ar: رؤيتنا

source: To be the leading provider of professional uniforms in Saudi Arabia, recognized for our quality, innovation, and commitment to customer satisfaction.
ar: أن نكون المزود الرائد للزي المهني في المملكة العربية السعودية، معترف بنا لجودتنا وابتكارنا والتزامنا برضا العملاء.

source: Our Mission
ar: مهمتنا

source: To deliver high-quality, durable, and stylish uniforms that enhance our clients' brand image while providing exceptional value and service.
ar: تقديم زي عالي الجودة ومتين وأنيق يعزز صورة علامة عملاؤناالتجارية مع توفير قيمة وخدمة استثنائية.

source: Our Core Values
ar: قيمنا الأساسية

source: Precision in Design
ar: الدقة في التصميم

source: Meticulous attention to detail in every uniform we create.
ar: اهتمام دقيق بالتفاصيل في كل زي نقوم بإنشائه.

source: Creativity & Flexibility
ar: الإبداع والمرونة

source: Innovative designs tailored to meet unique client needs.
ar: تصاميم مبتكرة مصممة لتلبية احتياجات العملاء الفريدة.

source: High-Quality Fabrics
ar: أقمشة عالية الجودة

source: Only the finest materials for comfort and durability.
ar: أفضل المواد فقط للراحة والمتانة.

source: Commitment to Deadlines
ar: الالتزام بالمواعيد النهائية

source: Reliable delivery schedules you can count on.
ar: جداول تسليم موثوقة يمكنك الاعتماد عليها.

source: Our Process
ar: عمليتنا

source: Design
ar: التصميم

source: Collaborative design process to create the perfect uniform
ar: عملية تصميم تعاونية لإنشاء الزي المثالي

source: Fabric Cutting
ar: قص القماش

source: Precision cutting for consistent quality
ar: قص دقيق لجودة متسقة

source: Production
ar: الإنتاج

source: Expert craftsmanship in every stitch
ar: حرفية خبيرة في كل غرزة

source: Delivery
ar: التسليم

source: Timely delivery to your location
ar: تسليم في الوقت المحدد إلى موقعك

source: Our Facility
ar: منشأتنا

source: Aligned with Vision 2030
ar: متوافق مع رؤية 2030

source: Rwshan Gold Company is proud to contribute to Saudi Arabia's Vision 2030 by supporting local manufacturing, creating job opportunities, and delivering world-class products that enhance the Kingdom's global image.
ar: تفتخر شركة الروشن الذهبي بالمساهمة في رؤية المملكة العربية السعودية 2030 من خلال دعم التصنيع المحلي وخلق فرص العمل وتقديم منتجات عالمية المستوى تعزز الصورة العالمية للمملكة.

source: Products - Rwshan Gold Company
ar: المنتجات - شركة الروشن الذهبي

source: Premium Professional Uniforms for Every Industry
ar: زي مهني ممتاز لكل صناعة

source: No product categories available yet.
ar: لا توجد فئات منتجات متاحة بعد.

source: View Products
ar: عرض المنتجات

source: Back to Categories
ar: العودة إلى الفئات

source: Products in this Category
ar: المنتجات في هذه الفئة

source: No products available in this category yet.
ar: لا توجد منتجات متاحة في هذه الفئة بعد.

source: View Details
ar: عرض التفاصيل

source: Customize
ar: تخصيص

source: Starting price
ar: السعر الابتدائي

source: Customization Options
ar: خيارات التخصيص

source: Multiple fabric options
ar: خيارات أقمشة متعددة

source: Custom colors
ar: ألوان مخصصة

source: Logo embroidery
ar: خياطة الشعار

source: Size variations
ar: مقاسات متغيرة

source: Details
ar: التفاصيل

source: Specifications
ar: المواصفات

source: Your quotes are saved in this browser session. For permanent access, please consider creating an account.
ar: عروضك محفوظة في جلسة المتصفح هذه.

source: This quote is saved in your current browser session only.
ar: تم حفظ عرضك الحالي في الجلسة فقط

source: Care Instructions
ar: تعليمات العناية

source: Product Details
ar: تفاصيل المنتج

source: Detailed information about the product would go here. This could include features, benefits, and other important details that customers should know.
ar: المعلومات التفصيلية عن المنتج ستكون هنا. يمكن أن تشمل الميزات والفوائد وتفاصيل مهمة أخرى يجب أن يعرفها العملاء.

source: Material
ar: المادة

source: Premium cotton blend
ar: مزيج قطن ممتاز

source: Weight
ar: الوزن

source: 180 GSM
ar: 180 جرام لكل متر مربع

source: Available Sizes
ar: المقاسات المتاحة

source: Customization
ar: التخصيص

source: Embroidery, printing, color matching
ar: التطريز، الطباعة، مطابقة الألوان

source: Machine wash cold with like colors
ar: غسل في الغسالة الباردة مع الألوان المتشابهة

source: Do not bleach
ar: لا تستخدم مبيض

source: Tumble dry low
ar: تجفيف بالدوران على حرارة منخفضة

source: Iron on medium heat if needed
ar: كوي على حرارة متوسطة إذا لزم الأمر

source: Do not dry clean
ar: لا تنظف جافاً

source: Related Products
ar: منتجات ذات صلة

source: Related products will be displayed here.
ar: سيتم عرض المنتجات ذات الصلة هنا.

source: Design Your Uniform - Rwshan Gold Company
ar: صمم زيّك - شركة الروشن الذهبي

source: Create a custom uniform that represents your brand
ar: أنشئ زيًا مخصصًا يمثل علامتك التجارية

source: Select a Category
ar: اختر فئة

source: Select
ar: اختر

source: Customize Your Uniform - Rwshan Gold Company
ar: خصص زيّك - شركة الروشن الذهبي

source: Customize Your Uniform
ar: خصص زيّك

source: Select Category
ar: اختر الفئة

source: Customize Design
ar: خصص التصميم

source: Preview & Save
ar: انشاء عرض سعر

source: Upload Logo (Optional)
ar: رفع الشعار (اختياري)

source: Upload your company logo to be placed on the uniform
ar: ارفع شعار شركتك ليتم وضعه على الزي

source: Additional Notes (Optional)
ar: ملاحظات إضافية (اختيارية)

source: Continue to Preview
ar: متابعة إلى المعاينة

source: Back
ar: العودة

source: Preview Your Design - Rwshan Gold Company
ar: معاينة تصميمك - شركة الروشن الذهبي

source: Preview Your Design
ar: معاينة تصميمك

source: Uniform Preview
ar: معاينة الزي

source: Design Details
ar: تفاصيل التصميم

source: Product
ar: المنتج

source: Fabric
ar: القماش

source: Color
ar: اللون

source: Logo
ar: الشعار

source: Uploaded
ar: مرفوع

source: None
ar: لا يوجد

source: Notes
ar: ملاحظات

source: Name
ar: الاسم

source: Subject
ar: الموضوع

source: Message
ar: الرسالة

source: View My Quotes
ar: عروض الأسعار

source: Go to Homepage
ar: ارجع الى الرئيسية

source: Success!
ar: نجاح

source: Design & Consultation
ar: التصميم والاستشارات

source: Collaborative design process to create the perfect uniform that reflects your brand identity
ar: عملية تصميم تعاونية لإنشاء الزي المثالي الذي يعكس هوية علامتك التجارية

source: Fabric Selection
ar: اختيار الأقمشة

source: Premium fabric selection and precision cutting for consistent quality and comfort
ar: اختيار أقمشة فاخرة وقصّ دقيق لضمان جودة وثبات وراحة مستمرة

source: Expert craftsmanship and quality control in every stitch by our skilled artisans
ar: حرفية عالية ومراقبة جودة دقيقة في كل غرزة من قِبل حرفيينا المهرة

source: Delivery & Support
ar: التوصيل والدعم

source: Timely delivery to your location with ongoing support and maintenance services
ar: توصيل في الوقت المحدد إلى موقعك مع دعم وخدمات صيانة مستمرة

source: Our State-of-the-Art Facility
ar: منشأتنا الحديثة والمتطورة

source: Creative Design Studio
ar: استوديو التصميم الإبداعي

source: Where innovation meets tradition
ar: حيث يلتقي الابتكار بالتقاليد

source: Quality Control Center
ar: مركز مراقبة الجودة

source: Rigorous quality checks at every stage
ar: فحوصات جودة دقيقة في كل مرحلة

source: Advanced Production Line
ar: خط إنتاج متطور

source: Modern equipment for precision manufacturing
ar: معدات حديثة لتصنيع عالي الدقة

source: Aligned with Saudi Vision 2030
ar: تماشياً مع رؤية السعودية 2030

source: Rwshan Gold Company is proud to contribute to Saudi Arabia's Vision 2030 by supporting local manufacturing, creating job opportunities for Saudi talent, and delivering world-class products that enhance the Kingdom's global image and economic diversification.
ar: تفخر شركة الروشن الذهبي بمساهمتها في تحقيق رؤية المملكة العربية السعودية 2030 من خلال دعم التصنيع المحلي، وتوفير فرص عمل للمواهب السعودية، وتقديم منتجات عالمية المستوى تعزز الصورة العالمية للمملكة وتنوعها الاقتصادي.

source: Saudi Workforce
ar: القوى العاملة السعودية

source: Local Manufacturing
ar: التصنيع المحلي

source: Client Satisfaction
ar: رضا العملاء

source: Clients Served
ar: العملاء الذين تم خدمتهم

source: Only the finest materials selected for comfort, durability, and professional appearance.
ar: نختار أجود الخامات لضمان الراحة والمتانة والمظهر الاحترافي.

source: Innovative designs tailored to meet unique client needs and brand identities.
ar: تصاميم مبتكرة مصممة خصيصًا لتلبية احتياجات عملاؤناالفريدة وهويات علاماتهم التجارية.

source: Meticulous attention to detail in every uniform we create, ensuring perfect fit and finish.
ar: نهتم بأدق التفاصيل في كل زيّ نصممه، لضمان ملاءمة مثالية وتشطيب مثالي.

source: Reliable delivery schedules you can count on, every single time.
ar: مواعيد تسليم موثوقة يمكنك الاعتماد عليها في كل مرة.

source: Our Vision & Mission
ar: رؤيتنا & رسالتنا

source: Expert Team
ar: فريق من الخبراء

source: Skilled professionals with decades of experience
ar: خبراء ماهرون بخبرة تمتد لنسوات

source: Modern Facility
ar: منشأة حديثة

source: State-of-the-art manufacturing equipment
ar: معدات تصنيع متطورة

source: Certified quality standards in every product
ar: معايير الجودة المعتمدة في كل منتج

source: Quality Excellence
ar: التميز في الجودة

source: With years of experience in the industry, we have built a reputation for excellence, innovation, and reliability. Our commitment to quality craftsmanship and attention to detail has made us the preferred choice for leading businesses and institutions throughout the Kingdom.
ar: بجودتنا، اكتسبنا سمعة طيبة بفضل تميزنا وابتكارنا وموثوقيتنا. إن التزامنا بالجودة الحرفية والاهتمام بالتفاصيل جعلنا الخيار الأمثل للشركات والمؤسسات الرائدة في جميع أنحاء المملكة.

source: Founded in Riyadh, Saudi Arabia, Rwshan Gold Company has established itself as a premier manufacturer and supplier of professional uniforms across multiple sectors.
ar: تأسست شركة الروشان الذهبي في مكة، المملكة العربية السعودية، ورسخت مكانتها كشركة رائدة في تصنيع وتوريد الزي الرسمي المهني في مختلف القطاعات.

source: Explore our premium collection of professional uniforms
ar: استكشف مجموعتنا المتميزة من الأزياء الاحترافية

source: Back to Category
ar: ارجع الى الصنف

source: Get a Free Quote
ar: احصل على عرض سعر مجاني

source: No Testimonials Yet
ar: ليس هنالك شهادات بعد

source: Check back later for client testimonials and success stories!
ar: تحقق مرة أخرى لاحقًا للحصول على شهادات العملاء وقصص النجاح

source: Read all client feedback and success stories
ar: اقرأ جميع تعليقات العملاء وقصص النجاح

source: All Testimonials
ar: جميع الشهادات

source: Discover what our valued clients say about working with Rwshan Gold Company. Their success stories drive our passion for excellence.
ar: اكتشف آراء عملاؤناالكرام حول العمل مع شركة روشان الذهبي. قصص نجاحهم هي دافعنا نحو التميز.

source: View All Clients
ar: عرض جميع العملاء

source: Trusted by leading organizations and businesses across Saudi Arabia
ar: موثوق بنا من قبل المؤسسات والشركات الرائدة في جميع أنحاء المملكة

source: Our Valued Clients
ar: عملاؤناالكرام

source: Testimonials
ar: شهادات العملاء

source: My Quote Requests
ar: طلباتي

source: Quote Request Details
ar: تفاصيل طلب السعر

source: Back to My Quotes
ar: الرجوع الى عروض الأسعار

source: Your quote request has been submitted successfully.
ar: لقد تم تقديم عرض السعر الخاص بك بنجاح

source: Contact Person
ar: الجهة

source: Company Name
ar: الشركة

source: Invalid username or password. Please try again.
ar: خطأ في اسم المستخدم أو كلمة السر, حاول مرة أخرى

source: Sign in to your account
ar: تسجيل الدخول

source: Username
ar: اسم المستخدم

source: Log In
ar: تسجيل الدخول

source: Forgot your password?
ar: نسيت كلمة السر

source: Enter your username
ar: أدخل اسم المستخدم

source: Enter your password
ar: أدخل كلمة السر

source: Estimated Price
ar: السعر المقدر

source: Edit Design
ar: تعديل التصميم

source: Get Quote
ar: عرض سعر

source: No design found. Please start over.
ar: لم يتم العثور على تصميم. يرجى البدء من جديد.

source: Start Over
ar: ابدأ من جديد

source: Price Calculator - Rwshan Gold Company
ar: حاسبة الأسعار - شركة الروشن الذهبي

source: Get an instant estimate for your uniform order
ar: احصل على تقدير فوري لطلب الزي الخاص بك

source: Choose a product
ar: اختر منتجًا

source: Choose a fabric
ar: اختر قماشًا

source: Choose a color
ar: اختر لونًا

source: Quantity
ar: الكمية

source: Logo Complexity
ar: تعقيد الشعار

source: Simple
ar: بسيط

source: Medium
ar: متوسط

source: Complex
ar: معقد

source: Base Price
ar: السعر الأساسي

source: Fabric Upgrade
ar: ترقية القماش

source: Logo Fee
ar: رسوم الشعار

source: Unit Price
ar: سعر الوحدة

source: Quantity Discount
ar: خصم الكمية

source: Request Official Quote
ar: اطلب عرض سعر رسمي

source: Blog - Rwshan Gold Company
ar: المدونة - شركة الروشن الذهبي

source: Latest Insights
ar: آخر الرؤى

source: Read More
ar: اقرأ المزيد

source: No blog posts available yet.
ar: لا توجد منشورات مدونة متاحة بعد.

source: Categories
ar: الفئات

source: Newsletter
ar: النشرة الإخبارية

source: Subscribe to our newsletter for updates and offers.
ar: اشترك في نشرتنا الإخبارية للحصول على التحديثات والعروض.

source: Your email address
ar: عنوان بريدك الإلكتروني

source: Subscribe
ar: اشترك

source: By
ar: بواسطة

source: No related posts found.
ar: لم يتم العثور على منشورات ذات صلة.

source: Comments section would be implemented here.
ar: سيتم تنفيذ قسم التعليقات هنا.

source: Contact Us - Rwshan Gold Company
ar: اتصل بنا - شركة الروشن الذهبي

source: We'd love to hear from you. Send us a message and we'll respond as soon as possible.
ar: نحب أن نسمع منك. أرسل لنا رسالة وسنرد في أقرب وقت ممكن.

source: Get in Touch
ar: تواصل معنا

source: Send Message
ar: إرسال رسالة

source: Contact Information
ar: معلومات الاتصال

source: Address
ar: العنوان

source: Riyadh, Saudi Arabia
ar: مكة، المملكة العربية السعودية

source: Phone
ar: الهاتف

source: Email
ar: البريد الإلكتروني

source: Business Hours
ar: ساعات العمل

source: Monday - Friday: 9am - 5pm
ar: الاثنين - الجمعة: 9 صباحًا - 5 مساءً

source: Saturday: 10am - 2pm
ar: السبت: 10 صباحًا - 2 مساءً

source: Sunday: Closed
ar: الأحد: مغلق

source: Follow Us
ar: تابعنا

source: Frequently Asked Questions
ar: الأسئلة الشائعة

source: What is your return policy?
ar: ما هي سياسة الإرجاع الخاصة بك؟

source: Our return policy is 30 days.
ar: سياسة الإرجاع الخاصة بنا هي 30 يومًا.

source: Your message has been sent successfully! We will contact you soon.
ar: تم إرسال رسالتك بنجاح! سنتواصل معك قريبًا.

source: Your quote request has been submitted successfully!
ar: تم تقديم طلب عرض السعر بنجاح!

source: Home - Rwshan Gold Company
ar: الرئيسية - شركة الروشن الذهبي

source: About Us - Rwshan Gold Company
ar: من نحن - شركة الروشن الذهبي

source: Rwshan Gold Company - Premium Professional Uniforms
ar: شركة الروشن الذهبي - زي مهني ممتاز

source: Rwshan Gold Company. All rights reserved.
ar: شركة الروشن الذهبي. جميع الحقوق محفوظة.

source: Message Sent Successfully!
ar: تم إرسال الرسالة بنجاح!

source: Thank you for contacting Rwshan Gold Company. We have received your message and will get back to you soon.
ar: شكرًا لتواصلك مع شركة روشان جولد. لقد استلمنا رسالتك وسنقوم بالرد عليك قريبًا.

source: What Happens Next?
ar: ما الذي سيحدث بعد ذلك؟

source: Here's what you can expect in the coming hours
ar: إليك ما يمكنك توقعه خلال الساعات القادمة

source: Immediate Confirmation
ar: تأكيد فوري

source: You've received a confirmation email with details of your submission.
ar: لقد تلقيت رسالة تأكيد عبر البريد الإلكتروني تتضمن تفاصيل طلبك.

source: Review Process
ar: عملية المراجعة

source: Our team is reviewing your message and will assign it to the appropriate department.
ar: فريقنا يقوم بمراجعة رسالتك وسيحولها إلى القسم المناسب.

source: Response Preparation
ar: تحضير الرد

source: We're preparing a comprehensive response to address all your questions and concerns.
ar: نحن نقوم بإعداد رد شامل لمعالجة جميع أسئلتك واستفساراتك.

source: Final Response
ar: الرد النهائي

source: You'll receive a detailed response from our team within 24 hours.
ar: ستتلقى ردًا مفصلًا من فريقنا خلال 24 ساعة.

source: Return Home
ar: العودة إلى الصفحة الرئيسية

source: Go back to our homepage and explore more about our services.
ar: ارجع إلى صفحتنا الرئيسية وتعرّف أكثر على خدماتنا.

source: Browse FAQs
ar: تصفح الأسئلة الشائعة

source: Check our frequently asked questions for instant answers.
ar: اطّلع على الأسئلة الشائعة للحصول على إجابات فورية.

source: Explore our catalog of premium uniforms and custom designs.
ar: استكشف كتالوجنا من الزيّ الموحد الفاخر والتصاميم المخصصة.

source: Need Immediate Assistance?
ar: هل تحتاج إلى مساعدة فورية؟

source: For urgent matters, don't hesitate to contact us directly
ar: في الحالات الطارئة، لا تتردد في التواصل معنا مباشرة.

source: View FAQs
ar: عرض الأسئلة الشائعة

source: Homepage
ar: الصفحة الرئيسية

source: Email Us
ar: راسلنا عبر البريد الإلكتروني

source: Find quick answers to common questions about our products and services
ar: ابحث عن إجابات سريعة للأسئلة الشائعة حول منتجاتنا وخدماتنا

source: No FAQs Available
ar: لا توجد أسئلة شائعة متاحة

source: Check back later for frequently asked questions.
ar: تحقق لاحقًا لعرض الأسئلة الشائعة.

source: Still have questions?
ar: هل لا تزال لديك أسئلة؟

source: Our team is here to help you get the answers you need
ar: فريقنا هنا لمساعدتك في الحصول على الإجابات التي تحتاجها

source: Search FAQs...
ar: ابحث في الأسئلة الشائعة...

source: Click the color box to choose your preferred color
ar: انقر على مربع اللون لاختيار اللون المفضل لديك

source: No file chosen
ar: لم يتم اختيار اسم الملف بعد

source: Choose File
ar: اختر الملف

source: Popular Colors
ar: الألوان الشائعة

source: Choose Color
ar: اختر اللون

source: We're here to assist you with all your gold product needs. Reach out to our expert team for personalized service and consultation.
ar: نحن هنا لمساعدتك في جميع احتياجاتك من منتجات الروشان الذهبي. تواصل مع فريقنا للحصول على خدمة واستشارة مخصصة.

source: Send Us a Message
ar: أرسل لنا رسالة

source: Full Name
ar: الاسم الكامل

source: Your Message
ar: رسالتك

source: Our Address
ar: عنواننا

source: Phone Number
ar: رقم الهاتف

source: Email Address
ar: عنوان البريد الإلكتروني

source: Follow Our Journey
ar: تابع رحلتنا

source: Stay updated with our latest gold collections and exclusive offers
ar: ابق على اطلاع بأحدث مجموعات الروشان الذهبي لدينا والعروض الحصرية

source: Get immediate answers to common questions about our premium gold products and services
ar: احصل على إجابات فورية للأسئلة الشائعة حول منتجاتنا وخدماتنا

source: Search for answers...
ar: ابحث عن الإجابات...

source: We're currently preparing our frequently asked questions. Please check back soon or contact us directly.
ar: نحن نعمل حاليًا على إعداد الأسئلة الشائعة. يرجى العودة لاحقًا أو التواصل معنا مباشرة.

source: Our gold experts are ready to provide personalized assistance for all your inquiries
ar: فريقنا جاهزون لتقديم المساعدة المخصصة لجميع استفساراتك

source: Prefer to call?
ar: هل تفضل الاتصال؟

source: Contact Support
ar: اتصل بالدعم

source: Get In Touch
ar: تواصل معنا

source: Get an instant, accurate estimate for your premium uniform order with our advanced calculator
ar: احصل على تقدير فوري ودقيق لطلبك من الزي الموحد الفاخر باستخدام حاسبتنا المتقدمة

source: Custom Quote Calculator
ar: حاسبة عرض السعر المخصص

source: Product Selection
ar: اختيار المنتج

source: Choose from our premium uniform collection
ar: اختر من مجموعتنا المميزة للأزياء الموحدة

source: Premium fabric options available
ar: خيارات الأقمشة الفاخرة متاحة

source: Custom color matching available
ar: تتوفر إمكانية مطابقة الألوان المخصصة

source: Bulk discounts available for larger orders
ar: تتوفر خصومات على الطلبات الكبيرة

source: Simple - Basic logo placement
ar: بسيط - وضع شعار أساسي

source: Choose the complexity level for logo application
ar: اختر مستوى التعقيد لتطبيق الشعار

source: Select product options to see detailed pricing
ar: اختر خيارات المنتج لعرض التسعير التفصيلي

source: Additional Notes & Requirements
ar: ملاحظات ومتطلبات إضافية

source: Any special requirements or notes for your order...
ar: أي متطلبات أو ملاحظات خاصة لطلبك...

source: Instant Calculation
ar: حساب فوري

source: Real-time price updates as you customize your order
ar: تحديثات أسعار فورية أثناء تخصيص طلبك

source: Bulk Discounts
ar: خصومات الجملة
