Repository: TawheebAlsuidy/rwshan-gold
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Automatic discounts for larger quantity orders
ar: خصومات تلقائية على الطلبات ذات الكميات الكبيرة

source: Quality Guarantee
ar: ضمان الجودة

source: Premium materials and craftsmanship guaranteed
ar: نضمن استخدام مواد فاخرة وحرفية عالية الجودة

source: Quick turnaround times for all custom orders
ar: أوقات تنفيذ سريعة لجميع الطلبات المخصصة

source: Fast Delivery
ar: توصيل سريع

source: Complex - Intricate design work
ar: معقد - تصميم مُعقّد

source: Medium - Detailed embroidery
ar: متوسط ​​- تطريز مُفصّل

source: Logo Application
ar: تطبيق الشعار

source: Subtotal
ar: المجموع

source: Total Price
ar: الاجمالي

source: units
ar: وحدات

source: Next
ar: التالي

source: Previous
ar: السابق

source: Why Choose Our Uniforms?
ar: لماذا تختار أزيائنا الموحدة؟

source: Experience the difference with our premium quality and exceptional service
ar: اختبر الفرق مع جودة منتجاتنا الفاخرة وخدمتنا الاستثنائية

source: Premium Quality
ar: جودة فاخرة

source: Crafted with the finest materials and attention to detail for lasting durability
ar: مصنوعة من أجود المواد مع اهتمام بأدق التفاصيل لضمان المتانة الطويلة

source: Custom Fit
ar: تفصيل مخصص

source: Tailored to perfection with precise measurements for optimal comfort
ar: مصممة بدقة تامة وفق القياسات لضمان الراحة المثالية

source: Custom Design
ar: تصميم مخصص

source: Personalized designs that reflect your brand identity and professionalism
ar: تصاميم مخصصة تعكس هوية علامتك التجارية واحترافيتك

source: Quick turnaround times without compromising on quality and precision
ar: أوقات تنفيذ سريعة دون المساومة على الجودة والدقة

source: Happy Clients
ar: عملاء سعداء

source: Industries Served
ar: القطاعات التي نخدمها

source: Uniforms Delivered
ar: زي موحد تم تسليمه

source: Satisfaction Rate
ar: معدل الرضا

source: Choose the type of uniform you want to customize
ar: اختر نوع الزي الذي تريد تصميمه

source: Enter any special requirements or notes...
ar: أدخل أي متطلبات أو ملاحظات خاصة...
